Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/edc/PIC32MM0128GPM048.PIC
      <edc:SFRDef edc:_addr="0x1F802B50" edc:_begin="0x360" edc:_end="0x4d0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="2" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="RPOR4" edc:desc="" edc:impl="0x1f1f1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="RPOR4" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RP17R" edc:desc="" edc:mask="0x1f" edc:name="RP17R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="RP18R" edc:desc="" edc:mask="0x1f" edc:name="RP18R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="RP19R" edc:desc="" edc:mask="0x1f" edc:name="RP19R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="RP20R" edc:desc="" edc:mask="0x1f" edc:name="RP20R" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802B60" edc:_begin="0x360" edc:_end="0x4d0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="2" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="RPOR5" edc:desc="" edc:impl="0xf87820df" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu---uuuuu---uuuuu---uuuuu" edc:name="RPOR5" edc:nzwidth="32" edc:por="---xxxxx---xxxxx---xxxxx---xxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RP21R" edc:mask="0x1f" edc:name="RP21R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="RP22R" edc:mask="0x1f" edc:name="RP22R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="RP23R" edc:mask="0x1f" edc:name="RP23R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="RP24R" edc:mask="0x1f" edc:name="RP24R" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F802B70" edc:offset="0x40"/>
      <edc:SFRDef edc:_addr="0x1F802BB0" edc:_begin="0x4d0" edc:_end="0x8b0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="3" edc:access="-------------------------n--nnnn" edc:cname="ANSELA" edc:desc="" edc:grp="PORTA" edc:impl="0xffff004f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------------1--1111" edc:name="ANSELA" edc:nzwidth="0x20" edc:por="-------------------------1--1111" edc:portals="CLR SET INV" ltx:baseofperipheral="PORTA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ANSA0" edc:desc="" edc:mask="0x1" edc:name="ANSA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSA1" edc:desc="" edc:mask="0x1" edc:name="ANSA1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSA2" edc:desc="" edc:mask="0x1" edc:name="ANSA2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSA3" edc:desc="" edc:mask="0x1" edc:name="ANSA3" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ANSA6" edc:desc="" edc:mask="0x1" edc:name="ANSA6" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802BC0" edc:_begin="0x4d0" edc:_end="0x8b0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="3" edc:access="----------------n----nnnnnnnnnnn" edc:cname="TRISA" edc:desc="" edc:grp="PORTA" edc:impl="0xffff87ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------1----11111111111" edc:name="TRISA" edc:nzwidth="0x20" edc:por="----------------1----11111111111" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TRISA0" edc:desc="" edc:mask="0x1" edc:name="TRISA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISA1" edc:desc="" edc:mask="0x1" edc:name="TRISA1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISA2" edc:desc="" edc:mask="0x1" edc:name="TRISA2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISA3" edc:desc="" edc:mask="0x1" edc:name="TRISA3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISA4" edc:desc="" edc:mask="0x1" edc:name="TRISA4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISA5" edc:desc="" edc:mask="0x1" edc:name="TRISA5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISA6" edc:desc="" edc:mask="0x1" edc:name="TRISA6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISA7" edc:desc="" edc:mask="0x1" edc:name="TRISA7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISA8" edc:desc="" edc:mask="0x1" edc:name="TRISA8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISA9" edc:desc="" edc:mask="0x1" edc:name="TRISA9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISA10" edc:desc="" edc:mask="0x1" edc:name="TRISA10" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TRISA15" edc:desc="" edc:mask="0x1" edc:name="TRISA15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802BD0" edc:_begin="0x4d0" edc:_end="0x8b0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="3" edc:access="----------------n----nnnnnnnnnnn" edc:cname="PORTA" edc:desc="" edc:grp="PORTA" edc:impl="0xffff87ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------x----xxxxxxxxxxx" edc:name="PORTA" edc:nzwidth="0x20" edc:por="----------------x----xxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RA0" edc:desc="" edc:mask="0x1" edc:name="RA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RA1" edc:desc="" edc:mask="0x1" edc:name="RA1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RA2" edc:desc="" edc:mask="0x1" edc:name="RA2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RA3" edc:desc="" edc:mask="0x1" edc:name="RA3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RA4" edc:desc="" edc:mask="0x1" edc:name="RA4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RA5" edc:desc="" edc:mask="0x1" edc:name="RA5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RA6" edc:desc="" edc:mask="0x1" edc:name="RA6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RA7" edc:desc="" edc:mask="0x1" edc:name="RA7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RA8" edc:desc="" edc:mask="0x1" edc:name="RA8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RA9" edc:desc="" edc:mask="0x1" edc:name="RA9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RA10" edc:desc="" edc:mask="0x1" edc:name="RA10" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RA15" edc:desc="" edc:mask="0x1" edc:name="RA15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802BE0" edc:_begin="0x4d0" edc:_end="0x8b0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="3" edc:access="----------------n----nnnnnnnnnnn" edc:cname="LATA" edc:desc="" edc:grp="PORTA" edc:impl="0xffff87ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0----00000000000" edc:name="LATA" edc:nzwidth="0x20" edc:por="----------------0----00000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LATA0" edc:desc="" edc:mask="0x1" edc:name="LATA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATA1" edc:desc="" edc:mask="0x1" edc:name="LATA1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATA2" edc:desc="" edc:mask="0x1" edc:name="LATA2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATA3" edc:desc="" edc:mask="0x1" edc:name="LATA3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATA4" edc:desc="" edc:mask="0x1" edc:name="LATA4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATA5" edc:desc="" edc:mask="0x1" edc:name="LATA5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATA6" edc:desc="" edc:mask="0x1" edc:name="LATA6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATA7" edc:desc="" edc:mask="0x1" edc:name="LATA7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATA8" edc:desc="" edc:mask="0x1" edc:name="LATA8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATA9" edc:desc="" edc:mask="0x1" edc:name="LATA9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATA10" edc:desc="" edc:mask="0x1" edc:name="LATA10" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="LATA15" edc:desc="" edc:mask="0x1" edc:name="LATA15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802BF0" edc:_begin="0x4d0" edc:_end="0x8b0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="3" edc:access="----------------n----nnnnnnnnnnn" edc:cname="ODCA" edc:desc="" edc:grp="PORTA" edc:impl="0xffff87ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0----00000000000" edc:name="ODCA" edc:nzwidth="0x20" edc:por="----------------0----00000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ODCA0" edc:desc="" edc:mask="0x1" edc:name="ODCA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCA1" edc:desc="" edc:mask="0x1" edc:name="ODCA1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCA2" edc:desc="" edc:mask="0x1" edc:name="ODCA2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCA3" edc:desc="" edc:mask="0x1" edc:name="ODCA3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCA4" edc:desc="" edc:mask="0x1" edc:name="ODCA4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCA5" edc:desc="" edc:mask="0x1" edc:name="ODCA5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCA6" edc:desc="" edc:mask="0x1" edc:name="ODCA6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCA7" edc:desc="" edc:mask="0x1" edc:name="ODCA7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCA8" edc:desc="" edc:mask="0x1" edc:name="ODCA8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCA9" edc:desc="" edc:mask="0x1" edc:name="ODCA9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCA10" edc:desc="" edc:mask="0x1" edc:name="ODCA10" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ODCA15" edc:desc="" edc:mask="0x1" edc:name="ODCA15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
