Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/edc/PIC32MM0128GPM048.PIC
      <edc:SFRDef edc:_addr="0x1F8035C0" edc:_begin="0x2e0" edc:_end="0x360" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="4" edc:access="-----------n-------n-----------n" edc:cname="PMD1" edc:desc="" edc:impl="0x101001" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------0-------0-----------0" edc:name="PMD1" edc:nzwidth="32" edc:por="-----------0-------0-----------0" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCMD" edc:mask="0x1" edc:name="ADCMD" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xb"/>
            <edc:SFRFieldDef edc:cname="VREFMD" edc:desc="" edc:mask="0x1" edc:name="VREFMD" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="7"/>
            <edc:SFRFieldDef edc:cname="HLVDMD" edc:desc="" edc:mask="0x1" edc:name="HLVDMD" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8035D0" edc:_begin="0x2e0" edc:_end="0x360" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="4" edc:access="----nnnn---------------------nnn" edc:cname="PMD2" edc:desc="" edc:impl="0xf000007" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000---------------------000" edc:name="PMD2" edc:nzwidth="32" edc:por="----0000---------------------000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CMP1MD" edc:desc="" edc:mask="0x1" edc:name="CMP1MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CMP2MD" edc:desc="" edc:mask="0x1" edc:name="CMP2MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CMP3MD" edc:mask="0x1" edc:name="CMP3MD" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x15"/>
            <edc:SFRFieldDef edc:cname="CLC1MD" edc:desc="" edc:mask="0x1" edc:name="CLC1MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CLC2MD" edc:desc="" edc:mask="0x1" edc:name="CLC2MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CLC3MD" edc:mask="0x1" edc:name="CLC3MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLC4MD" edc:mask="0x1" edc:name="CLC4MD" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8035E0" edc:_begin="0x2e0" edc:_end="0x360" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="4" edc:access="---------------nnnnnnnnn--------" edc:cname="PMD3" edc:desc="" edc:impl="0x1ff00" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------000000000--------" edc:name="PMD3" edc:nzwidth="32" edc:por="---------------000000000--------" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="CCP1MD" edc:desc="" edc:mask="0x1" edc:name="CCP1MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CCP2MD" edc:desc="" edc:mask="0x1" edc:name="CCP2MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CCP3MD" edc:desc="" edc:mask="0x1" edc:name="CCP3MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CCP4MD" edc:mask="0x1" edc:name="CCP4MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CC5MD" edc:mask="0x1" edc:name="CC5MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CC6MD" edc:mask="0x1" edc:name="CC6MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CC7MD" edc:mask="0x1" edc:name="CC7MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CC8MD" edc:mask="0x1" edc:name="CC8MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CC9MD" edc:mask="0x1" edc:name="CC9MD" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8035F0" edc:_begin="0x2e0" edc:_end="0x360" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="4" edc:access="-----------------------------nnn" edc:cname="PMD4" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------------------000" edc:name="PMD4" edc:nzwidth="32" edc:por="-----------------------------000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="T1MD" edc:desc="" edc:mask="0x1" edc:name="T1MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T2MD" edc:mask="0x1" edc:name="T2MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="T3MD" edc:mask="0x1" edc:name="T3MD" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F803600" edc:_begin="0x2e0" edc:_end="0x360" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="4" edc:access="-------n-----nnn-----nnn-----nnn" edc:cname="PMD5" edc:desc="" edc:impl="0x1070707" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------0-----000-----000-----000" edc:name="PMD5" edc:nzwidth="32" edc:por="-------0-----000-----000-----000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U1MD" edc:desc="" edc:mask="0x1" edc:name="U1MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U2MD" edc:desc="" edc:mask="0x1" edc:name="U2MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U3MD" edc:mask="0x1" edc:name="U3MD" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="SPI1MD" edc:desc="" edc:mask="0x1" edc:name="SPI1MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI2MD" edc:desc="" edc:mask="0x1" edc:name="SPI2MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI3MD" edc:mask="0x1" edc:name="SPI3MD" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="I2C1MD" edc:desc="" edc:mask="0x1" edc:name="I2C1MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C2MD" edc:desc="" edc:mask="0x1" edc:name="I2C2MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C3MD" edc:mask="0x1" edc:name="I2C3MD" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="USBMD" edc:mask="0x1" edc:name="USBMD" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F803610" edc:_begin="0x2e0" edc:_end="0x360" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="4" edc:access="-----------------------n-------n" edc:cname="PMD6" edc:desc="" edc:impl="0x101" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------------0-------0" edc:name="PMD6" edc:nzwidth="32" edc:por="-----------------------0-------0" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RTCCMD" edc:desc="" edc:mask="0x1" edc:name="RTCCMD" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="7"/>
            <edc:SFRFieldDef edc:cname="REFOMD" edc:desc="" edc:mask="0x1" edc:name="REFOMD" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
